#선행작업: pip install --upgrade pip, pip install google

from googlesearch import search

#딕셔너리를 이용한 응답 시스템
#'알파벳으로 표현된 관'과 '실제 관' 이름 매칭 
responses= {"default":"GOOGLE", "A관": "사범대학관","B관": "미술관","C관": "가정관","D관": "생활예술관",
"E관": "학군단","F관": "체육관","G관": "제 1공학관","H관": "학생회관","I관": "제2교수회관","J관": "대학본부",
"K관": "제2공학관","L관": "학술정보관","M관": "월해관","N관": "자하관","O관": "제1교수회관","R관": "미래백년관",
"S관": "중앙교수회관","T관": "경영경제대학관","U관": "문화예술관", }    

# 학과 번호 
responses2= {"역사콘텐츠전공":"02-2287-5042","지적재산권전공": "02-2287-5234",
"문헌정보학전공": "02-2287-5064","공간환경학부": "02-2287-5047","행정학부": "02-2287-5399,5187","가족복지학과": "02-2287-5254",
"국가안보학과": "02-2287-7596","국어교육과": "02-2287-5090","영어교육과": "02-2287-5098","교육학과": "02-2287-5082",
"수학교육과" : "02-2287-5123","경영경제학부": "02-2287-5258","경영학부": "02-2287-5206, 5282, 5061"
,"글로벌경영학과": "02-2287-5051,5056","융합경영학과": "02-2287-5078",
"핀테크, 빅데이터융합, 스마트생산전공": "02-2287-5403","휴먼지능정보공학전공":"02-2287-5391"
,"컴퓨터과학전공": "02-2287-5292","전기공학전공": "02-2287-5112","지능IOT융합전공": "02-2287x`-5392","게임전공": "02-2287-5462"
,"애니메이션전공": "02-2287-5464", "한일문화콘텐츠전공": "02-2287-5116","생명과학전공": "02-2287-5142"
,"화학에너지공학전공": "02-2287-5283", "화공신소재전공": "02-2287-5297","식품영양전공": "02-2287-5129"
,"의류학전공": "02-2287-5154","스포츠건강관리전공": "02-2287-5153","무용예술전공":"02-2287-5156","조형예술전공": "02-2287-5302",
"생활예술전공": "02-2287-5167","음악학부": "02-2287-5172, 5320, 5323, 5481"}


# 기타 정보들
responses3 = {"영어 시험":"http://pf.kakao.com/_LSUrj","영어":"http://pf.kakao.com/_LSUrj","토익":"http://pf.kakao.com/_LSUrj",
"학사일정": "https://www.smu.ac.kr/ko/life/academicCalendar.do","학교일정":"https://www.smu.ac.kr/ko/life/academicCalendar.do","일정":"https://www.smu.ac.kr/ko/life/academicCalendar.do",
"공지사항":"https://www.smu.ac.kr/lounge/notice/notice.do?mode=list&srCategoryId1=&srCampus=&srSearchKey=&srSearchVal=","공지":"https://www.smu.ac.kr/lounge/notice/notice.do?mode=list&srCategoryId1=&srCampus=&srSearchKey=&srSearchVal=",
"학사정보":"https://www.smu.ac.kr/ko/life/curriculum.do", "교육과정":"https://www.smu.ac.kr/ko/life/curriculum.do"
,"장학제도":"https://www.smu.ac.kr/ko/life/payment.do", "장학금":"https://www.smu.ac.kr/ko/life/payment.do",
"학생증":"https://www.smu.ac.kr/ko/life/studentIdCard.do","학생증발급":"https://www.smu.ac.kr/ko/life/studentIdCard.do"
,"기숙사":"https://dormitory.smu.ac.kr/dormi/index.do", "학생생활관":"https://dormitory.smu.ac.kr/dormi/index.do"
,"기숙사 안내":"https://dormitory.smu.ac.kr/dormi/index.do"}

#동의어 처리- 학과
responses4={"역콘":"02-2287-5042","지재":"02-2287-5234", "지적재산":"02-2287-5234", 
"문헌정보":"02-2287-5064","문정":"02-2287-5064", "문정과":"02-2287-5064","공환":"02-2287-5047" ,
"행정":"02-2287-5399",  "가복":"02-2287-5254",    "국가안보":"02-2287-7596","안보":"02-2287-7596",


"국교":"02-2287-5090","국어교육":"02-2287-5090",   "영교":"02-2287-5098","영어교육":"02-2287-5098", 
"교육학과":"02-2287-5082",  "수교":"02-2287-5123","수학교육":"02-2287-5123",

# 부정확한 입력 대비
"경영":"1. 경영경제학부, 2.경영학부, 3.글로벌경영학과,4.융합경영학과 중 하나를 다시 입력해주세요.",

"1": "02-2287-5258",
"경영경제": "02-2287-5258",

"2":"02-2287-5206, 5282, 5061",
"경영": "02-2287-5206, 5282, 5061",

"3": "02-2287-5051, 5056",
"글경": "02-2287-5051, 5056",

"4": "02-2287-5078",
"융합경영": "02-2287-5078",

"핀테크":"02-2287-5403", "핀빅스":"02-2287-5403", "빅데이터":"02-2287-5403", "스마트생산":"02-2287-5403",
"휴먼":"02-2287-5391", "휴먼과":"02-2287-5391","휴먼지능":"02-2287-5391",
"컴과":"02-2287-5292","컴공":"02-2287-5292",

"전기":"02-2287-5112",  
"IOT":"02-2287-5392", "지능융합":"02-2287-5392" , "지능":"02-2287-5392",

"게임":"02-2287-5462",
"애니":"02-2287-5464", "애니메이션":"02-2287-5464",
"한콘":"02-2287-5116" ,

"생명":"02-2287-5142", "생공":"02-2287-5142",

#부정확한 입력 대비2
"화공":"1. 화학에너지공학전공, 2. 화공신소재전공 중 하나를 다시 입력해주세요.",

"화에공":"02-2287-5283", 
"신소재":"02-2287-5297", 

"식영":"02-2287-5129","의류":"02-2287-5154",

"스건":"02-2287-5153, 5326 ", "스포츠건강":"02-2287-5153, 5326 ",
"무용예술":"02-2287-5156", "무용과":"02-2287-5156", "무용":"02-2287-5156",
 
"조형":"02-2287-5302", "조예":"02-2287-5302", "조예과":"02-2287-5302",
"생활예술":"02-2287-5167","생예":"02-2287-5167" ,
"음악":"02-2287-5172, 5320, 5323, 5481",}

# responses를 범주별로 구분하고, .update()를 통해 통합
responses.update(responses2)
responses.update(responses3) 
responses.update(responses4)
# respond 함수 정의 
def respond(user_message):
    if user_message in responses:
        bot_message = responses[user_message]
    else:
        bot_message = responses['default']
        
    return bot_message

print("질문 입력 예시: M관, 국가안보학과.. etc")

while True:
    user_message = input('질문을 정확한 단어로 입력해주세요:')
    user_message = user_message.strip()
    if user_message == '끝' or user_message == "":
        break

    answer = respond(user_message) 
# 알지 못하는 질문에 대한 구글 라이브러리 이용
    if answer == "GOOGLE":
        query = user_message
        search_result_list = list(search(query, stop=3))
        for item in search_result_list:
            print(item)
    else:
        print(answer)
    


